// clean-code.io

// Оголошення порожнього масиву
// Мета: оголосити порожній масив під назвою myArray 

let arr1 = [];
let arr2 = new Array();

/////////////////////////////////////////////////////////////////////
// Доступ до елемента масиву
// Мета: задано масив чисел = [1, 2, 3 , 4 , 5], отримати доступ і надрукувати третій елемент.

let numbers = [1, 2, 3, 4, 5];

let thirdElement = numbers[2];

console.log(thirdElement); //  3

/////////////////////////////////////////////////////////////////////
// Заміна елементів масиву
// Мета: замінити другий елемент масиву fruits = ['apple', 'banana', 'cherry'] на ' grape ' 

let fruits = ['apple', 'banana', 'cherry'];

fruits[1] = 'grape';

console.log(fruits); // 'apple', 'grape', 'cherry'

/////////////////////////////////////////////////////////////////////
// Розрахунок довжини масиву
// Мета: обчислити та надрукувати довжину кольорів масиву = [ ' red ' , 'green', ' blue', 'yellow ' ]


// let colors = ['red', 'green', 'blue', 'yellow'];

// let lengthOfColors = colors.length;

// console.log(lengthOfColors); //  4

/////////////////////////////////////////////////////////////////////
// Нарізка масиву
// Мета : витягнути частину масиву за допомогою методу зрізу 

// let colors = ['red', 'green', 'blue', 'yellow', 'purple', 'orange'];

// let slicedColors = colors.slice(2, 5); 

// console.log(slicedColors); // 'blue', 'yellow', 'purple'

/////////////////////////////////////////////////////////////////////
// Пошук елементів масиву
// Мета : знайти індекс певного елемента в масиві за допомогою методу indexOf 

let colors = ['red', 'green', 'blue', 'yellow', 'purple', 'orange'];

let index = colors.indexOf('yellow');

console.log(index); //  3

/////////////////////////////////////////////////////////////////////
// Ітерація масиву
// Мета: прокрутити масив nums = [10, 20, 30, 40 , 50] і надрукувати кожен елемент 

let nums = [10, 20, 30, 40, 50];

for (let i = 0; i < nums.length; i++) {
    console.log(nums[i]); 
}

/////////////////////////////////////////////////////////////////////
// Операції Push і Pop
// Мета: задано стек масиву = [ 1, 2 , 3], використайте метод push , щоб додати 4 і 5 до кінця ,
//  а потім використайте метод pop , щоб видалити останній елемент.

let stack = [1, 2, 3];

stack.push(4); // Додаємо 4
stack.push(5); // Додаємо 5

console.log(stack); // 1,2,3,4,5

let removedElement = stack.pop(); 

console.log(stack); // 1,2,3,4

/////////////////////////////////////////////////////////////////////
// Конкатенація масиву
// Мета: об’єднати два масиви arr1 = [1, 2, 3] і arr2 = [4, 5, 6],
//  щоб створити новий результат масиву , який містить усі елементи 

// let arr1 = [1, 2, 3];
// let arr2 = [4, 5, 6];

// let resultArray = arr1.concat(arr2);

// console.log(resultArray); //1,2,3,4,5,6

/////////////////////////////////////////////////////////////////////
// Фільтрація масиву
// Мета: задано масив чисел nums = [5, 10, 15, 20 , 25 ], 
// створити новий масив evenNumbers , який містить лише парні числа 

// let nums = [5, 10, 15, 20, 25];

// let evenNumbers = nums.filter(function(num) {
//     return num % 2 === 0; // Перевірка, чи число парне
// });

// console.log(evenNumbers); //10,20

/////////////////////////////////////////////////////////////////////
// Зрощення масивів
// Мета: видалити елементи з масиву та замінити їх новими за допомогою методу splice ( ) .

// Оголошення початкового масиву
// let fruits = ['apple', 'banana'];

// fruits.splice(1, 'orange');

// console.log( fruits);


/////////////////////////////////////////////////////////////////////
// Розповсюдження масиву
// Мета: об’єднати кілька масивів в один за допомогою оператора поширення 

let array1 = [1, 2, 3];
let array2 = [4, 5, 6];
let array3 = [7, 8, 9];

let combinedArray = [...array1, ...array2, ...array3];

console.log(combinedArray); //1,2,3,4,5,6,7,8,9

/////////////////////////////////////////////////////////////////////
// Копіювання масиву
// Мета : створити копію існуючого масиву .

let originalArray = [1, 2, 3, 4, 5];
let copiedArray = originalArray.slice();

console.log(copiedArray); // 1, 2, 3, 4, 5

/////////////////////////////////////////////////////////////////////
// Видалення елементів масиву
// Мета : видалити елемент із масиву без використання методу з’єднання 

// let colors = ['red', 'green', 'blue', 'yellow'];
// let filteredColors = colors.filter(color => color !== 'green'); 

// console.log(filteredColors); // 'red', 'blue', 'yellow'

/////////////////////////////////////////////////////////////////////
// Відображення масиву
// Мета: задано масив temperaturesCelsius = [0, 25, 10 , 32, 15], створити новий масив temperaturesFahrenheit,
//  перетворивши кожну температуру за Цельсієм у Фаренгейт ( C * 9/5) + 32

let temperaturesCelsius = [0, 25, 10, 32, 15];

let temperaturesFahrenheit = temperaturesCelsius.map(tempC => (tempC * 9/5) + 32);

console.log(temperaturesFahrenheit); // 32, 77, 50, 89.6, 59

/////////////////////////////////////////////////////////////////////
// Сортування масиву
// Мета: відсортувати назви масивів = ['Alice', 'Charlie', 'Bob', 'David' ] 
// в алфавітному порядку та надрукувати результат 

let names = ['Alice', 'Charlie', 'Bob', 'David'];

names.sort();

console.log(names); // 'Alice', 'Bob', 'Charlie', 'David'

/////////////////////////////////////////////////////////////////////
// Фільтрування та відображення масивів
// Мета: задано масив рядків words = [ ' apple', ' banana', 'cherry'],
//  створити новий масив , що містить довжину кожного слова.

const words = ['apple', 'banana', 'cherry'];

const lengths = words.map(word => word.length);

console.log(lengths); // 5, 6, 6

/////////////////////////////////////////////////////////////////////
// Унікальні значення масиву
// Ціль: задано масив duplicates = [1, 2, 2 , 3, 4 , 4, 5],
//  створити новий масив uniqueValues, що містить лише унікальні значення

let duplicates = [1, 2, 2, 3, 4, 4, 5];

let uniqueValues = [...new Set(duplicates)];

console.log(uniqueValues); // 1, 2, 3, 4, 5
