//1
// Оголошення змінних JavaScript
// Використовуйте varключове слово, щоб створити змінну під назвою myName
// var myName;
// myName = "Viktoriia";

//2

// Зберігання значень за допомогою оператора присвоєння
// Присвоїти значення 7змінній a

// var a;
// a = 7;

//3
// Присвоєння значення однієї змінної іншій
// Призначте вміст aзмінній b

// var a;
// a = 7;
// var b;
// b = a;

//4
// Ініціалізація змінних за допомогою оператора присвоєння
// Визначте змінну aза допомогою varта ініціалізуйте її значенням 9

// var myVar =0
// var a =9;

//5
// Оголошення рядкових змінних
// Створіть дві нові рядкові змінні: myFirstNameі myLastNameта призначте їм значення вашого імені та прізвища відповідно

// var myFirstName = "Viktoriia";
// var myLastName = "Sokolova";

//6
// Розуміння неініціалізованих змінних
// Ініціалізуйте три змінні a, b, та c за допомогою 5, 10, і "I am a"відповідно , щоб їх не було undefined

// var a = 5;
// var b = 10;
// var c = "I am a";

// a = a + 1;
// b = b + 5;
// c = c + " String!";

//7
// Розуміння чутливості до регістру змінних
// Змініть існуючі оголошення та призначення, щоб їхні імена використовували camelCase .

// Не створюйте жодних нових змінних

// var studlyCapVar;
// var properCamelCase;
// var titleCaseOver;

// studlyCapVar = 10;
// properCamelCase = "A String";
// titleCaseOver = 9000;

//8
// Дослідіть відмінності між ключовими словами var і let
// Оновіть код, щоб він використовував лише letключове слово.

// var catName = "Oliver";
// var catSound = "Meow!";

// let catName = "Oliver";
// let catSound = "Meow!";

//9
// Оголошення змінної лише для читання з ключовим словом const
// Змініть код так, щоб усі змінні оголошувалися за допомогою letабо const. Використовуйте let, коли ви хочете, щоб змінна змінювалася, і constколи ви хочете, щоб змінна залишалася постійною. Крім того, перейменуйте змінні, оголошені за допомогою , constщоб відповідати загальним практикам. Не змінюйте рядки, призначені змінним.

// var fCC = "freeCodeCamp"; // Change this line
// var fact = "is cool!"; // Change this line
// fact = "is awesome!";
// console.log(fCC, fact); // Change this line

// const FCC = "freeCodeCamp"; 
// let fact = "is cool!"; 
// fact = "is awesome!";
// console.log(FCC, fact); 

//10
// Додайте два числа за допомогою JavaScript
// Змініть 0так, щоб сума дорівнювала 20.

// // const sum = 10 + 0;
// const sum = 10 + 10;

//11
// Відніміть одне число від іншого за допомогою JavaScript
// Змініть 0 так, що різниця 12

// // const difference = 45 - 0;
// const difference = 45 - 33;

//12
// Помножте два числа за допомогою JavaScript
// Змініть 0так, щоб добуток дорівнював 80

// // const product = 8 * 0;
// const product = 8 * 10;

//13
// Розділіть одне число на інше за допомогою JavaScript
// Змініть 0так, щоб quotientдорівнювало 2

// // const quotient = 66 / 0;
// const quotient = 66 / 33;

//14
// Збільште число за допомогою JavaScript
// Змініть код, щоб використовувати ++оператор on myVar

// // let myVar = 87;
// // myVar = myVar + 1;

// let myVar = 87;
// myVar ++;

//15
// Зменшення числа за допомогою JavaScript
// Змініть код, щоб використовувати --оператор on myVar

// // let myVar = 11;
// // myVar = myVar - 1;

// let myVar = 11;
// myVar --;

//16
// Створення десяткових чисел за допомогою JavaScript
// Створіть змінну myDecimalта надайте їй десяткове значення з дробовою частиною (наприклад, 5.7)

// const ourDecimal = 5.7;
// const myDecimal = 2.2;

//17
// Помножте два десяткові знаки за допомогою JavaScript
// Змініть 0.0так, щоб добуток дорівнював 5.0

// // const product = 2.0 * 0.0;
// const product = 2.0 * 2.5;

//18
// Розділіть один десятковий дроб на інший за допомогою JavaScript
// Змініть 0.0так, щоб quotientдорівнювало 2.2

// // const quotient = 0.0 / 2.0; // Change this line
// const quotient = 4.4 / 2.0; 

//19
// Пошук залишку в JavaScript
// Встановіть remainderрівним залишку від 11ділення за 3допомогою оператора залишку ( %)

// // const remainder = 0;
// let remainder;
// remainder = 11 % 3;

//20
// Складне завдання зі збільшеним додаванням
// Перетворіть призначення для a, b і c на використання +=оператора

// let a = 3;
// let b = 17;
// let c = 12;

// // Only change code below this line
// // a = a + 12;
// // b = 9 + b;
// // c = c + 7;


// a += 12;
// b += 9;
// c += 7;

//21
// Складене завдання зі збільшеним відніманням
// Перетворіть призначення для a, bі cна використання -=оператора

// let a = 11;
// let b = 9;
// let c = 3;

// // Only change code below this line
// // a = a - 6;
// // b = b - 15;
// // c = c - 1;

// a -= 6;
// b -= 15;
// c -= 1;

//22
// Складене завдання зі збільшеним множенням
// Перетворіть призначення для a, bі cна використання *=оператора

// let a = 5;
// let b = 12;
// let c = 4.6;

// // Only change code below this line
// // a = a * 5;
// // b = 3 * b;
// // c = c * 10;

// a *= 5;
// b *= 3;
// c *= 10;

//23
// Складене завдання зі збільшеним діленням
// Перетворіть призначення для a, bі cна використання /=оператора

// let a = 48;
// let b = 108;
// let c = 33;

// // Only change code below this line
// // a = a / 12;
// // b = b / 4;
// // c = c / 11;

// a /= 12;
// b /= 4;
// c /= 11;